app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas"
---
  def index
    @ideas = Idea.all

SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 2]]
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @comments = @idea.comments.all
    @comment = @idea.comments.build
    @idea = Idea.find(params[:id])

INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Smiley"], ["description", "Face"], ["picture", "01-smiling-snake-emoji.png"], ["created_at", "2019-06-08 04:24:27.140658"], ["updated_at", "2019-06-08 04:24:27.140658"]]
---
  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save

UPDATE "ideas" SET "picture" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["picture", "sample-1.jpg"], ["updated_at", "2019-06-08 04:40:09.921541"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @idea.update(idea_params)

DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 1]]
---
  def destroy
    @idea.destroy

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_idea
      @idea = Idea.find(params[:id])